Core/src/DataProcessors/AzRyСредныйКурсЗаПериод/AzRyСредныйКурсЗаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRyСредныйКурсЗаПериод</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/DataProcessors/AzRyСредныйКурсЗаПериод/ObjectModule.bsl
Функция ЗапросСреднийКурсЗаМесяц(Период, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СРЕДНЕЕ(КурсыВалют.Курс) КАК Курс,
		|	СРЕДНЕЕ(КурсыВалют.Кратность) КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &Период1 И &Период2
		|	И КурсыВалют.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Ответ = Новый Структура("Курс, Кратность", РезультатЗапроса[0].Курс, РезультатЗапроса[0].Кратность);
	
	Возврат Ответ;
	
КонецФункции
